'use client';
import React from 'react';
import {Panel} from 'primereact/panel';
import Link from 'next/link';
import {Button} from 'primereact/button';

export default function Rules() {

  const panelHeaderTemplate = ({ className, titleClassName, props }: any) => {
    const classNames = `${className} justify-content-space-between`;
    return <div className={classNames}>
      <h2 className={`${titleClassName}` + ' text-lg m-0'}
          style={{
            color: "inherit!important",
            lineHeight: 1,
            fontWeight: 700,
      }}>{props.header}</h2>
    </div>
  }

  return (
    <div className="card p-fluid">
      <h1 className="h3 text-center"> قوانین و مقررات بی‌واسط برای استفاده از خدمات املاک بدون واسطه</h1>
      <hr/>
      <Panel header="پذیرش شرایط" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          ورود کاربران به وب‌سایت و اپلیکیشن بی‌واسط و استفاده از خدمات آن به معنای آگاهی و پذیرش کامل قوانین و مقررات
          زیر است. این شرایط ممکن است در هر زمان تغییر کند و ادامه استفاده از خدمات سایت به منزله پذیرش تغییرات خواهد
          بود.
        </p>
      </Panel>
      <Panel header="ماهیت خدمات" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          پلتفرم بی‌واسط صرفاً بستری برای درج و مشاهده آگهی‌ها در زمینه املاک و خدمات ساختمانی است و هیچ‌گونه دخالتی در
          محتوای آگهی‌ها، صحت اطلاعات، کیفیت خدمات یا انجام معاملات ندارد.
        </p>
      </Panel>
      <Panel header="مسئولیت آگهی‌گذاران" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <div className="m-2">
          <ul>
            <li><p>کلیه اطلاعات مندرج در آگهی‌ها (از جمله قیمت، شرایط معامله، مشخصات ملک یا کالا و خدمات) توسط آگهی‌گذار
              درج می‌شود.</p></li>
            <li><p>صحت و اعتبار اطلاعات منتشرشده، تماماً بر عهده آگهی‌گذار است.</p></li>
            <li><p>آگهی‌گذار متعهد می‌شود از درج اطلاعات نادرست، گمراه‌کننده یا خلاف قوانین کشور خودداری کند.</p></li>
          </ul>
        </div>
      </Panel>
      <Panel header="مسئولیت کاربران" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <div className="m-2">
          <ul>
            <li><p>کاربران موظفند پیش از هرگونه معامله، نسبت به بررسی کامل صحت اطلاعات آگهی اقدام نمایند.</p></li>
            <li><p>هرگونه توافق یا معامله بین کاربر و آگهی‌گذار مستقل از بی‌واسط بوده و سایت هیچ‌گونه مسئولیتی در قبال
              نتایج آن نخواهد داشت.</p></li>
          </ul>
        </div>
      </Panel>
      <Panel header="سلب مسئولیت قیمت‌ها" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <div className="m-2">
          <ul>
            <li><p>قیمت‌های درج‌شده صرفاً توسط آگهی‌گذاران اعلام می‌شود.</p></li>
            <li><p>پلتفرم بی‌واسط هیچ‌گونه مسئولیتی در قبال درستی، دقت یا تغییر قیمت‌ها بر عهده ندارد.</p></li>
            <li><p>مسئولیت اختلافات ناشی از قیمت یا سایر شرایط معامله صرفاً متوجه آگهی‌گذار و کاربر است.</p></li>
          </ul>
        </div>
      </Panel>
      <Panel header="محتوای ممنوعه" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          انتشار آگهی‌هایی با محتوای غیرقانونی، توهین‌آمیز، مغایر با قوانین و شئونات اجتماعی یا ناقض حقوق اشخاص، اکیداً
          ممنوع است. در صورت مشاهده، آگهی بدون اطلاع قبلی حذف خواهد شد.
        </p>
      </Panel>
      <Panel header="مالکیت معنوی" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          کلیه حقوق مادی و معنوی طراحی سایت، نرم‌افزار، لوگو و محتوای اختصاصی متعلق به بی‌واسط است و هرگونه کپی‌برداری
          یا استفاده غیرمجاز پیگرد قانونی دارد.
        </p>
      </Panel>
      <Panel header="تغییر یا توقف خدمات" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          پلتفرم بی‌واسط این حق را دارد که در هر زمان، بدون اطلاع قبلی، بخشی یا تمامی خدمات خود را تغییر داده یا متوقف
          نماید.
        </p>
      </Panel>
      <Panel header="حریم خصوصی" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          اطلاعات کاربران طبق سیاست حفظ حریم خصوصی سایت جمع‌آوری و نگهداری می‌شود و جز در موارد الزامی قانونی یا با
          رضایت کاربر، در اختیار اشخاص ثالث قرار نخواهد گرفت.
        </p>
      </Panel>
      <Panel header="قانون حاکم" headerTemplate={panelHeaderTemplate} className="text-lg red m-2">
        <p className="m-2">
          کلیه قوانین و مقررات سایت مطابق با قوانین و مقررات جمهوری اسلامی ایران تفسیر و اجرا می‌گردد و هرگونه اختلاف از
          طریق مراجع ذی‌صلاح قانونی رسیدگی خواهد شد
        </p>
      </Panel>
      {/*<Panel header="در خصوص مالکین" className="text-lg red m-2">
                <p className="m-2">
                    1-در راستای سیاست گذاری تیم بی‌واسط ، که محوریت عملکرد این تیم ، بر پایه حذف واسطه ها و ارتباط مستقیم مالکین و مصرف کنندگان میباشد ، در جهت راستی آزمایی عملکرد بهتر ، کلیه مالکین پس از بارگذاری اطلاعات ملک خود توسط تیم بی‌واسط
                    احراز مالکیت شده(سایت ثبت من) شده ، توسط این بستر مالک شناخته میشود و اطلاعات به صورت رایگان <span className="text-red-500">آگهی</span> شده و در جهت مصرف کننده قرار میگیرد.
                </p>
                <p className="m-2">
                    2-تیم بی‌واسط اطلاعات ملک مالکین را به مصرف کنندگان به نمایش درآورده و قبل از ارسال به مصرف کنندگان ، <span className="text-red-500">به لحظه موجودیت ملک</span> توسط این تیم استعلام شده و به مصرف کنندگان ارسال میگردد ، بدیهیست کلیه
                    مسئولیت های ناشی از بازدید ملک توسط مصرف کنندگان به عهده ی مالکین میباشد و تیم بی‌واسط هیچ مسئولیتی را در این خصوص پذیرا نیست.
                </p>
                <p className="m-2">3-خواهشمند است مالکین محترم پس از واگذاری ملک مورد فروش / اجاره ، نسبت به حذف آن از بستر سایت اقدام نمایند ، که جلوگیری از تماس های مکرر از ناحیه تیم بیواسط به عمل آید.</p>
                <p className="m-2">
                    4-این بستر سایت به <span className="text-red-500">جهت آگهی مالکین کاملا رایگان بوده</span> و بدون واسطه // بدون کمیسیون ، و هرگونه هزینه ای خدمات ارائه میگردد.
                </p>
                <p className="m-2">5-در صورت تمایل در راستای خدمات دهی بهتر مالکین میتوانند عکس های واقعی مربوط به ملک خود را در این سایت بارگذاری نمایند به همراه فیلد های مورد نظر.</p>
                <p className="m-2">6-هرگونه کپی برداری و تولید محتوا از بستر این سایت و اپیلیکیشن غیر قانونی بوده و مشمول پیگرد قانونی خواهد بود.</p>
            </Panel>
            <Panel header="در خصوص مصرف کنندگان" className="text-lg red m-2">
                <p className="m-2">
                    (
                  <span className="text-blue-300">در جهت راستی آزمایی عملکرد این بستر ، اولین سفارش شما تا سقف 3 فایل رایگان بوده تا عملکرد ما اثبات گردد،پس از آن در صورت تمایل میتوانید نسبت به خرید تک فایل یا اشتراک ماهانه به همراه تخفیفات (بیشتر از 3 عدد 30% تخفیف،بیشتر از 7 عدد 50% تخفیف)</span>
                    <span className="text-blue-300">
                        در جهت راستی آزمایی عملکرد این بستر ، اولین مورد انتخابی به صورت <span className="text-red-500">آگهی</span> بوده تا عملکرد ما اثبات گردد،پس از آن درصورت تمایل میتوانید نسبت به خرید موارد ، در قالب بسته های پیشنهادی اقدام
                        نمایید
                    </span>
                    )
                </p>
                <p className="m-2">
                    1-در راستای سیاست گذاری تیم بی‌واسط ، محوریت عملکرد این تیم بر پایه <span className="text-red-500">حذف واسطه ها و حذف کمیسیون</span> میباشد. بدین منظور ، <span className="text-red-500">تیم بی‌واسط</span> ، ارتباط مستقیم بین مصرف
                    کنندگان را محیا کرد.
                </p>
                <p className="m-2">2-در قسمت درخواست ، موارد شهر ، محله ، متراژ ، تعداد خواب و قیمت ، انتخاب گردد پس از آن توسط تیم بی‌واسط با توجه به درخواست ، تعداد ملک های موجود را به نمایش می گذارد به همراه موارد پیشنهادی.</p>
                <p className="m-2">
                    3-در راستای سیاست گذاری تیم بی‌واسط به هنگام انتخاب موارد مورد نظر،نسبت به انتخاب موارد <span className="text-red-500">جایگزین</span> متناسب با موارد انتخابی اقدام نمایید. موارد انتخابی شما قبل از ارسال ، به لحظه ، استعلام موجودی
                    شده ، پس از آن ارسال میگردد. (<span className="text-red-500">در صورت عدم موجودی موارد اولیه انتخابی ، از موارد جایگزین ارسال میگردد</span>)
                </p>
                <p className="m-2">
                    4-در صورت بروز اشکالات فنی و عدم اتصال به درگاه خرید اینترنتی و عدم ارسال موارد خریداری شده ، با تیم <span className="text-red-500">پشتیبانی</span> تماس حاصل فرمایید یا در قسمت تیکت موارد خود را اعلام نمایید. در صورت عدم ارسال
                    موارد خریداری شده بنا بر اختلالات فنی حداکثر تا <span className="text-red-500">72 ساعت</span> پس از تماس با پشتیبانی یا گذاشتن تیکت وجه پرداختی عودت میگردد.
                </p>
            </Panel>
            <Panel header="جذب آگهی" className="text-lg red m-2">
                <p className="m-2">
                    تیم بی‌واسط ، در جهت جذب آگهی <span className="text-blue-300">ملک مالکین ملک</span> ، کاملا <span className="text-red-500">رایگان</span> عمل کرده و در جهت خدمات بهتر از کلیه مشاغل مرتبط با صنعت ساختمان ،{' '}
                    <span className="text-red-500">جذب آگهی</span> ، با تعرفه های مطروحه در فیلد جذب آگهی همکاری مینماید.
                </p>
            </Panel>
            <Panel header="راستی آزمایی" className="text-lg red m-2">
                <p className="m-2">
                    تیم بی‌واسط در جهت اعتماد و اطمینان خریداران محترم ، به هر شماره موبایل 7 اطلاعات ملک درخواستی به صورت رایگان(تا زمان اعلامی به مدت محدود)اهدا میگردد و در صورت تمایل میتوانید نسبت به خرید موارد انتخابی اقدام نمایید.
                </p>
            </Panel>*/}
      <Link href={'/'} className="flex align-content-center justify-content-end mt-3">
        <Button raised type="submit" label="بازگشت" className="bg-gray-300 text-color border-0 w-1"/>
      </Link>
    </div>
  );
}
