'use client';
import React from 'react';
import { Panel } from 'primereact/panel';
import Link from 'next/link';
import { Button } from 'primereact/button';

export default function Rules() {
    return (
        <div className="card p-fluid">
            <h3 className="text-center">قوانین و مقررات</h3>
            <hr />
            <Panel header="در خصوص مالکین" className="text-lg red m-2">
                <p className="m-2">
                    1-در راستای سیاست گذاری تیم بی واسط ، که محوریت عملکرد این تیم ، بر پایه حذف واسطه ها و ارتباط مستقیم مالکین و مصرف کنندگان میباشد ، در جهت راستی آزمایی عملکرد بهتر ، کلیه مالکین پس از بارگذاری اطلاعات ملک خود توسط تیم بی واسط
                    احراز مالکیت شده(سایت ثبت من) شده ، توسط این بستر مالک شناخته میشود و اطلاعات به صورت رایگان <span className="text-red-500">آگهی</span> شده و در جهت مصرف کننده قرار میگیرد.
                </p>
                <p className="m-2">
                    2-تیم بی واسط اطلاعات ملک مالکین را به مصرف کنندگان به نمایش درآورده و قبل از ارسال به مصرف کنندگان ، <span className="text-red-500">به لحظه موجودیت ملک</span> توسط این تیم استعلام شده و به مصرف کنندگان ارسال میگردد ، بدیهیست کلیه
                    مسئولیت های ناشی از بازدید ملک توسط مصرف کنندگان به عهده ی مالکین میباشد و تیم بی واسط هیچ مسئولیتی را در این خصوص پذیرا نیست.
                </p>
                <p className="m-2">3-خواهشمند است مالکین محترم پس از واگذاری ملک مورد فروش / اجاره ، نسبت به حذف آن از بستر سایت اقدام نمایند ، که جلوگیری از تماس های مکرر از ناحیه تیم بیواسط به عمل آید.</p>
                <p className="m-2">
                    4-این بستر سایت به <span className="text-red-500">جهت آگهی مالکین کاملا رایگان بوده</span> و بدون واسطه // بدون کمیسیون ، و هرگونه هزینه ای خدمات ارائه میگردد.
                </p>
                <p className="m-2">5-در صورت تمایل در راستای خدمات دهی بهتر مالکین میتوانند عکس های واقعی مربوط به ملک خود را در این سایت بارگذاری نمایند به همراه فیلد های مورد نظر.</p>
                <p className="m-2">6-هرگونه کپی برداری و تولید محتوا از بستر این سایت و اپیلیکیشن غیر قانونی بوده و مشمول پیگرد قانونی خواهد بود.</p>
            </Panel>
            <Panel header="در خصوص مصرف کنندگان" className="text-lg red m-2">
                <p className="m-2">
                    (
                    <span className="text-blue-300">
                        در جهت راستی آزمایی عملکرد این بستر ، اولین مورد انتخابی به صورت <span className="text-red-500">آگهی</span> بوده تا عملکرد ما اثبات گردد،پس از آن درصورت تمایل میتوانید نسبت به خرید موارد ، در قالب بسته های پیشنهادی اقدام
                        نمایید
                    </span>
                    )
                </p>
                <p className="m-2">
                    1-در راستای سیاست گذاری تیم بی واسط ، محوریت عملکرد این تیم بر پایه <span className="text-red-500">حذف واسطه ها و حذف کمیسیون</span> میباشد. بدین منظور ، <span className="text-red-500">تیم بی واسط</span> ، ارتباط مستقیم بین مصرف
                    کنندگان را محیا کرد.
                </p>
                <p className="m-2">2-در قسمت درخواست ، موارد شهر ، محله ، متراژ ، تعداد خواب و قیمت ، انتخاب گردد پس از آن توسط تیم بی واسط با توجه به درخواست ، تعداد ملک های موجود را به نمایش می گذارد به همراه موارد پیشنهادی.</p>
                <p className="m-2">
                    3-در راستای سیاست گذاری تیم بی واسط به هنگام انتخاب موارد مورد نظر،نسبت به انتخاب موارد <span className="text-red-500">جایگزین</span> متناسب با موارد انتخابی اقدام نمایید. موارد انتخابی شما قبل از ارسال ، به لحظه ، استعلام موجودی
                    شده ، پس از آن ارسال میگردد. (<span className="text-red-500">در صورت عدم موجودی موارد اولیه انتخابی ، از موارد جایگزین ارسال میگردد</span>)
                </p>
                <p className="m-2">
                    4-در صورت بروز اشکالات فنی و عدم اتصال به درگاه خرید اینترنتی و عدم ارسال موارد خریداری شده ، با تیم <span className="text-red-500">پشتیبانی</span> تماس حاصل فرمایید یا در قسمت تیکت موارد خود را اعلام نمایید. در صورت عدم ارسال
                    موارد خریداری شده بنا بر اختلالات فنی حداکثر تا <span className="text-red-500">72 ساعت</span> پس از تماس با پشتیبانی یا گذاشتن تیکت وجه پرداختی عودت میگردد.
                </p>
            </Panel>
            <Panel header="جذب آگهی" className="text-lg red m-2">
                <p className="m-2">
                    تیم بی واسط ، در جهت جذب آگهی <span className="text-blue-300">مالکین ملک</span> ، کاملا <span className="text-red-500">رایگان</span> عمل کرده و در جهت خدمات بهتر از کلیه مشاغل مرتبط با صنعت ساختمان ،{' '}
                    <span className="text-red-500">جذب آگهی</span> ، با تعرفه های مطروحه در فیلد جذب آگهی همکاری مینماید.
                </p>
            </Panel>
            <Panel header="راستی آزمایی" className="text-lg red m-2">
                <p className="m-2">
                    تیم بی واسط در جهت اعتماد و اطمینان خریداران محترم ، به هر شماره موبایل یک عدد اطلاعات ملک درخواستی به صورت رایگان(تا زمان اعلامی به مدت محدود)اهدا میگردد و در صورت تمایل میتوانید نسبت به خرید موارد انتخابی اقدام نمایید.
                </p>
            </Panel>
            <Link href={'/'} className="flex align-content-center justify-content-end mt-3">
                <Button raised type="submit" label="بازگشت" className="bg-gray-300 text-color border-0 w-1" />
            </Link>
        </div>
    );
}
