import React, {useState} from 'react';
import styles from './timeBanner.module.scss';
import Marquee from "react-fast-marquee";

const MarqueeBanner = () => {
  const [jalaliTime, setJalaliTime] = useState('');
  const [content, setContent] = useState('');
  const contents = [
    'ثبت قرار داد رایگان',
    'چی می خوای برات پیدا کنم ، خواستت رو‌بگو‌‌بکردم برات',
    'پیگیری مشتری',
    'ثبت قرار داد رایگان',
    'ثبت آگهی رایگان',
    'معرفی ارائه دهدنگان خدمات ساختمانی',
    'معرفی فروشندگان محصولات ساختمانی',
    'معرفی فروسندگان لوازم خانگی',
    'اولین و بزرگترین پلتفرم جامع ساختمان',
    'از معرفی تا بستن قرار داد بی کمیسیون تا نظافت و خدمات ساختمانی و خرید اقلام ساختمان و لوازم خانگی همراهتان هستیم',
    'اولین و جامع ترین پلتفرم ساختمان ( خرید /اجاره و محصولات) بی‌واسط‌بی‌کمیسیون',
    'هدف ما حذف واسطه ،حذف کمیسیون/ ارایه کلیه خدمات در راستای خانه دار شدن شما تا استفاده بهینه',
    'ارائه خدمات ثبت قرار داد فروش و اجاره ملک به طور کاملا رایگان جهت کاربران پلتفرم بی‌واسط',
    'و ثبت قرار داد اجاره /فروش  با ۵۰۰ هزار تومان برای کاریران خارج پلتفرم',
    'از معرفی و ارتباط مستقیم با توجه به خواسته شما تا پایان ثبت قرار داد کنارتان هستیم ، دیگه نگران قیمت های غیر واقعی /عکس های غیر واقعی / و تنظیم قرار داد و خدمات و خرید کلیه اقلام ساختمانی نباشید',
    'همه موارد به طور جامع در یک پلتفرم',
    'و‌برای اولین بار بدون واسطه ارتباط مستقیم با مالک بدون کمیسیون',
    'پايين هدر زير نويس مثل شبكه خبر اونجا كه ساعت متحرك داره',
    'تبلیغ در بله',
    'استراتژی قرعه خدمات',
  ];
  const staticContent = 'انقلابی در صنعت  معاملات کشور | اولین و جامع ترین پلتفرم ملک | بدون حضور واسطه ها | ❌کمیسیون حذف شد ❌ | اینجا محل آگهی واسطه ها نیست  | از معرفی ملک مالکین (بدون واسطه) تا ارتباط مستقیم به مالک با توجه به خواسته شما ، ثبت قرار داد در سامانه رسمی  ( کاملا رایگان- مخصوص استفاده کنندگان پلتفرم)  دیگه نگران قیمت های غیر واقعی /عکس های غیر واقعی / عدم موجودیت موارد فروش یا اجاره-(فایل های استعلامی) -آگهی غیر واقعی-و تنظیم قرار داد نباش ، ما (تیم بی واسط) کنارتان هستیم | شاید براتون سوال باشه چرا باید برای دیدن اطلاعات فایل های ملک ما پول بدیم در حالی که سایر پلتفرم ها پولی نیست؟! | ' +
    'در سایر پلتفرم ها آگهی دهنده ها اکثرا واسطه ها هستند که اگر توسط واسطه ها ملک رو ببینید باید کمیسیون بدید، در حالی که با ارتباط مستقیمی که توسط ما به مالک داده میشین دیگه واسطه و کمیسیونی نیست | ' +
    'حالا ببین خوبه بری واسه دیدن ملک کمیسیون بدی یا بیای مستقیم به مالک وصل شی | از آنجایی که برابر قانون مصوب الزام ثبت قرارداد اموال غیر منقول از مورخ 1403/04/03 قرارداد های عادی و دست نویس یا تنظیمی واسطه ها فاقد ارزش قانونی و در صورت بروز مشکل قضایی فاقد اعتبار میباشد،کلیه‌ی قرارداد ها اعم از اجاره یا فروش میبایست در سامانه رسمی خودنویس یا کاتب تنظیم شود که اینگونه قرارداد ها به جهت خرید و فروش جنبه‌ی پیش نویس داشته و به جهت قطعی شدن قرارداد (مبایعه نامه)میبایست به دفاتر اسناد رسمی مراجعه شود،در صورت عدم مراجعه (در مهلت قانونی)اینگونه قرارداد ها از درجه‌ی اعتبار ساقط است و همچنین توصیه میشود به جهت خرید و فروش پس از حضور در دفتر خانه و ثبت مبایعه نامه قانونی نسبت به جا به جایی وجوهات پرداختی اقدام نمایید.لازم به ذکر است کلیه‌ی افراد حقیقی و عادی به جهت انجام معامله ، اعم از اجاره یا فروش ملک،بدون نیاز به حضور واسطه و بدون پرداخت کمیسیون می توانند در سامانه رسمی قراردادشان را منعقد و سپس به دفاتر اسناد رسمی مراجعه نمایند.'
  /*useEffect(() => {
    // const updateTime = () => {
    //   const now = moment().locale('fa').format('HH:mm | jD jMMMM jYYYY');
    //   setJalaliTime(now);
    // };

    // const resetKeys = () => {
    //   setIntervalKey(pre => pre + 1)
    // }

    // updateTime();
    updateContent();
    const interval = setInterval(updateContent, 240000); // update every minute
    const intervalKeys = setInterval(updateContent, 3000);
    return () => {
      clearInterval(interval);
      clearInterval(intervalKeys);
    }
  }, []);*/
  return (
    <div className="custom-marquee py-3">
      <span className="marquee-content text-white">{staticContent}</span>
    </div>
    // <Marquee speed={400} direction="right"
    //          className={styles.wrapper}>
    //   {
    //     contents.map((content, index) => content)
    //   }
    //   {/*<div className="">{staticContent}</div>*/}
    // </Marquee>
  )
};

export default MarqueeBanner;
