import React, {useState} from 'react';
import styles from './timeBanner.module.scss';
import Marquee from "react-fast-marquee";

const MarqueeBanner = () => {
  const [jalaliTime, setJalaliTime] = useState('');
  const [content, setContent] = useState('');
  const contents = [
    'ثبت قرار داد رایگان',
    'چی می خوای برات پیدا کنم ، خواستت رو‌بگو‌‌بکردم برات',
    'پیگیری مشتری',
    'ثبت قرار داد رایگان',
    'ثبت آگهی رایگان',
    'معرفی ارائه دهدنگان خدمات ساختمانی',
    'معرفی فروشندگان محصولات ساختمانی',
    'معرفی فروسندگان لوازم خانگی',
    'اولین و بزرگترین پلتفرم جامع ساختمان',
    'از معرفی تا بستن قرار داد بی کمیسیون تا نظافت و خدمات ساختمانی و خرید اقلام ساختمان و لوازم خانگی همراهتان هستیم',
    'اولین و جامع ترین پلتفرم ساختمان ( خرید /اجاره و محصولات) بی‌واسط‌بی‌کمیسیون',
    'هدف ما حذف واسطه ،حذف کمیسیون/ ارایه کلیه خدمات در راستای خانه دار شدن شما تا استفاده بهینه',
    'ارائه خدمات ثبت قرار داد فروش و اجاره ملک به طور کاملا رایگان جهت کاربران پلتفرم بی واسط',
    'و ثبت قرار داد اجاره /فروش  با ۵۰۰ هزار تومان برای کاریران خارج پلتفرم',
    'از معرفی و ارتباط مستقیم با توجه به خواسته شما تا پایان ثبت قرار داد کنارتان هستیم ، دیگه نگران قیمت های غیر واقعی /عکس های غیر واقعی / و تنظیم قرار داد و خدمات و خرید کلیه اقلام ساختمانی نباشید',
    'همه موارد به طور جامع در یک پلتفرم',
    'و‌برای اولین بار بدون واسطه ارتباط مستقیم با مالک بدون کمیسیون',
    'پايين هدر زير نويس مثل شبكه خبر اونجا كه ساعت متحرك داره',
    'تبلیغ در بله',
    'استراتژی قرعه خدمات',
  ];
  const staticContent = 'انقلابی در صنعت  معاملات کشور | ' +
    'اولین و جامع ترین پلتفرم ملک | ' +
    'بدون حضور واسطه ها | ' +
    'یه خبر واقعی و خیلی خوب 😊 کمیسیون حذف شد 🙏🏽 | ' +
    'اینجا محل آگهی واسطه ها نیست  | ' +
    'از معرفی ملک مالکین (بدون واسطه) تا ارتباط مستقیم به مالک با توجه به خواسته شما ، ثبت قرار داد در سامانه رسمی  ( کاملا رایگان- مخصوص استفاده کنندگان پلتفرم)  دیگه نگران قیمت های غیر واقعی /عکس های غیر واقعی / عدم موجودیت موارد فروش یا اجاره (آگهی غیر واقعی) و تنظیم قرار داد نباش   ، ما (تیم بی واسط) کنارتان هستیم  | ' +
    'لازم به ذکر است  برابر قانون از تیر ماه سال ۱۴۰۳ کلیه قرار داد های تنظیمی به صورت عادی توسط طرفین معامله   یا واسطه ها فاقد اعتبار میباشد | ' +
    'و طبق قانون ، در صورت مشکل ، در محاکم قضایی ، قابل پیگیری نمیباشد  | ' +
    'پس الزاما  ، میبایست قرار داد ها در سامانه های رسمی (خودتویس - کاتب) ثبت گردد  | ' +
    'برای قرار داد های اجاره ثبت در این سامانه ها دارای اعتبار قانونی کامل و برای قرار داد های فروش میبایست پس از ثبت قرار داد در ‌یکی از سامانه  های مذکور ،  طرفین به دفترخانه اسناد رسمی مراجعه و‌نسبت به تثبیت قرار داد خرید و فروش خود اقدام کنند یا از همان ابتدا با مراجعه به دفاتر اسناد رسمی نسبت به انعقاد قرار داد خود اقدام کنن ،  | ' +
    'اگر با نحوه انعقاد قرار داد آشنا نیستین ، ما کنارتان تا تنظیم قرار دادنان هستیم | ' +
    'منتظر ، خدمات جدید ما باشید ، شگفت زده خواهید شد 😊'
  /*useEffect(() => {
    // const updateTime = () => {
    //   const now = moment().locale('fa').format('HH:mm | jD jMMMM jYYYY');
    //   setJalaliTime(now);
    // };

    // const resetKeys = () => {
    //   setIntervalKey(pre => pre + 1)
    // }

    // updateTime();
    updateContent();
    const interval = setInterval(updateContent, 240000); // update every minute
    const intervalKeys = setInterval(updateContent, 3000);
    return () => {
      clearInterval(interval);
      clearInterval(intervalKeys);
    }
  }, []);*/
  return (
    <div className="custom-marquee">
      <span className="marquee-content text-white">{staticContent}</span>
    </div>
    // <Marquee speed={400} direction="right"
    //          className={styles.wrapper}>
    //   {
    //     contents.map((content, index) => content)
    //   }
    //   {/*<div className="">{staticContent}</div>*/}
    // </Marquee>
  )
};

export default MarqueeBanner;
