import React, {useState} from 'react';
import styles from './timeBanner.module.scss';
import Marquee from "react-fast-marquee";

const MarqueeBanner = () => {
  const [jalaliTime, setJalaliTime] = useState('');
  const [content, setContent] = useState('');
  const contents = [
    'ثبت قرار داد رایگان',
    'چی می خوای برات پیدا کنم ، خواستت رو‌بگو‌‌بکردم برات',
    'پیگیری مشتری',
    'ثبت قرار داد رایگان',
    'ثبت آگهی رایگان',
    'معرفی ارائه دهدنگان خدمات ساختمانی',
    'معرفی فروشندگان محصولات ساختمانی',
    'معرفی فروسندگان لوازم خانگی',
    'اولین و بزرگترین پلتفرم جامع ساختمان',
    'از معرفی تا بستن قرار داد بی کمیسیون تا نظافت و خدمات ساختمانی و خرید اقلام ساختمان و لوازم خانگی همراهتان هستیم',
    'اولین و جامع ترین پلتفرم ساختمان ( خرید /اجاره و محصولات) بی‌واسط‌بی‌کمیسیون',
    'هدف ما حذف واسطه ،حذف کمیسیون/ ارایه کلیه خدمات در راستای خانه دار شدن شما تا استفاده بهینه',
    'ارائه خدمات ثبت قرار داد فروش و اجاره ملک به طور کاملا رایگان جهت کاربران پلتفرم بی‌واسط',
    'و ثبت قرار داد اجاره /فروش  با ۵۰۰ هزار تومان برای کاریران خارج پلتفرم',
    'از معرفی و ارتباط مستقیم با توجه به خواسته شما تا پایان ثبت قرار داد کنارتان هستیم ، دیگه نگران قیمت های غیر واقعی /عکس های غیر واقعی / و تنظیم قرار داد و خدمات و خرید کلیه اقلام ساختمانی نباشید',
    'همه موارد به طور جامع در یک پلتفرم',
    'و‌برای اولین بار بدون واسطه ارتباط مستقیم با مالک بدون کمیسیون',
    'پايين هدر زير نويس مثل شبكه خبر اونجا كه ساعت متحرك داره',
    'تبلیغ در بله',
    'استراتژی قرعه خدمات',
  ];
  const staticContent = 'انقلابی در صنعت  معاملات کشور | ' +
    'اولین و جامع ترین پلتفرم ملک | ' +
    'بدون حضور واسطه ها | ' +
    'یه خبر واقعی و خیلی خوب 😊 کمیسیون حذف شد 🙏🏽 | ' +
    'اینجا محل آگهی واسطه ها نیست  | ' +
    'از معرفی ملک مالکین (بدون واسطه) تا ارتباط مستقیم به مالک با توجه به خواسته شما ، ثبت قرار داد در سامانه رسمی  ( کاملا رایگان- مخصوص استفاده کنندگان پلتفرم)  دیگه نگران قیمت های غیر واقعی /عکس های غیر واقعی / عدم موجودیت موارد فروش یا اجاره (آگهی غیر واقعی) و تنظیم قرار داد نباش   ، ما (تیم بی‌واسط) کنارتان هستیم  | ' +
    'از انجایی که برابر قانون مصوب از مورخ 1403/03/03 قرارداد های عادی دست نویس یاتنظیمی واسطه ها صرفا به عنوان پیش نویس تلقی میگردد در صورت بروز مشکل و اختلاف در حکم قضایی قابل پیگیری و شکایت نمی باشد،در راستای قانون الزام به ثبت معاملات اموال غیر منقول(مبایعه نامه یا اجاره نامه)متقاضیان میتوانند با مراجعه به سامانه های رسمی(خودنویس یا کاتب)نسبت به ثبت پیش نویس قرارداد به طور قانونی و رسمی اقدام و پس از آن به جهت ثبت قطعی مبایعه نامه به دفاتر اسناد رسمی مراجعه مینمایند یا از همان ابتدا میتوانند نسبت به تنظیم این گونه قرارداد ها به دفاتر اسناد رسمی مراجعه نمایند(البته ملک مورد قرارداد میبایست در سامانه املاک و اسکان ثبت شده باشد)املاکی که در سامانه املاک و اسکان ثبت نشده باشد امکان انعقاد قرارداد رسمی ندارند.'
  /*useEffect(() => {
    // const updateTime = () => {
    //   const now = moment().locale('fa').format('HH:mm | jD jMMMM jYYYY');
    //   setJalaliTime(now);
    // };

    // const resetKeys = () => {
    //   setIntervalKey(pre => pre + 1)
    // }

    // updateTime();
    updateContent();
    const interval = setInterval(updateContent, 240000); // update every minute
    const intervalKeys = setInterval(updateContent, 3000);
    return () => {
      clearInterval(interval);
      clearInterval(intervalKeys);
    }
  }, []);*/
  return (
    <div className="custom-marquee py-3">
      <span className="marquee-content text-white">{staticContent}</span>
    </div>
    // <Marquee speed={400} direction="right"
    //          className={styles.wrapper}>
    //   {
    //     contents.map((content, index) => content)
    //   }
    //   {/*<div className="">{staticContent}</div>*/}
    // </Marquee>
  )
};

export default MarqueeBanner;
