'use client';
import React from 'react';
import { Accordion, AccordionTab } from 'primereact/accordion';

export default function Questions() {
    return (
        <div className="w-full mt-2">
            <Accordion activeIndex={0}>
                <AccordionTab header="چگونه می‌توان اپلیکیشن بی‌واسط را تهیه کرد؟">
                    <div style={{textAlign:'right'}}>
                        <p className="m-0">کاربران اندروید می‌توانند اپلیکیشن بی‌واسط را از کافه‌بازار و گوگل‌پلی دریافت و نصب کنند.
                        </p><p>
                        برای کاربران iOS نیز نسخه‌ی وب‌اپلیکیشن ارائه شده است که از طریق مرورگر قابل استفاده است.
                        </p>
                    </div>
                    
                </AccordionTab>
                <AccordionTab header="خدمات‌دهی در بی‌واسط به چه صورت است؟">
                <div style={{textAlign:'right'}}>
                        <p>برای آشنایی و اطمینان بیشتر از خدمات بی‌واسط، هر کاربر پس از ثبت‌نام، امکان دسترسی رایگان به اطلاعات کامل و شماره تماس مالکان 3 فایل را دارد.</p>
                        <p>پس از آن، برای مشاهده شماره تماس سایر فایل‌ها، پرداخت هزینه مطابق تعرفه تعیین‌شده ضروری خواهد بود.</p>
                        
                    </div>
                </AccordionTab>
                <AccordionTab header="استعلام وضعیت فایل‌ها به چه صورت انجام می‌شود؟">
                <div style={{textAlign:'right'}}>
                        <p>به‌منظور اطمینان از به‌روز بودن اطلاعات، وضعیت فایل‌ها به‌صورت لحظه‌ای و پیش از ارسال شماره تماس مالک بررسی می‌شود.</p>
                        <p>این فرآیند کمک می‌کند تا تنها فایل‌هایی برای کاربر ارسال شوند که در زمان درخواست، همچنان در دسترس و فعال باشند.</p>

                    </div>
                </AccordionTab>
                <AccordionTab header="در صورت موجود نبودن فایل انتخابی، چه اقدامی انجام می‌شود؟">    
                    <div style={{textAlign:'right'}}>
                        <p>پیش از ارسال شماره تماس، وضعیت فایل‌های انتخابی شما به‌صورت لحظه‌ای استعلام می‌شود.</p>
                        <p>در صورتی که فایل اصلی مورد نظر شما قبلاً واگذار شده باشد، فایل‌های رزرو شده شما جایگزین آن شده و برای شما ارسال خواهد شد.</p>
                    </div>
                </AccordionTab>
                <AccordionTab header="چگونه می‌توان فایل‌های مورد نظر را انتخاب کرد؟">    
                    <div style={{textAlign:'right'}}>
                        <p>پس از استفاده از دسترسی اولیه و مشاهده اطلاعات تماس 3 فایل رایگان، کاربران می‌توانند فایل‌های مورد نظر خود را از میان آگهی‌ها انتخاب کنند.</p>
                        <p>سپس با انتقال به صفحه درگاه پرداخت و تکمیل فرآیند خرید، شماره تماس مالکان فایل‌های انتخاب‌شده برای کاربر ارسال خواهد شد.</p>
                    </div>
                </AccordionTab>
                <AccordionTab header="چگونه می‌توان آگهی ثبت کرد؟">    
                    <div style={{textAlign:'right'}}>
                        <p>برای ثبت آگهی، ابتدا وارد حساب کاربری خود شوید و از طریق بخش پروفایل، گزینه‌ی ثبت آگهی را انتخاب نمایید.</p>
                        <p>سپس با وارد کردن اطلاعات ملک، آگهی شما پس از احراز مالکیت در پلتفرم بی‌واسط منتشر خواهد شد.خواهشمند است چنانچه موارد آگهی شده فروش یا اجاره رفته،نسبت به اطلاع رسانی به پلتفرم تحت قالب تیکت اعلام نمایید.</p>
                    </div>
                </AccordionTab>
                <AccordionTab header="چگونه می‌توان آگهی ثبت‌شده را ویرایش کرد؟">    
                    <div style={{textAlign:'right'}}>
                        <p>برای ویرایش آگهی، وارد حساب کاربری خود شوید و از طریق بخش پروفایل به قسمت آگهی‌ها مراجعه نمایید.
                        </p>
                        <p>سپس آگهی مورد نظر را انتخاب کرده و گزینه‌ی ویرایش را انتخاب کنید تا بتوانید اطلاعات آن را به‌روزرسانی کنید.</p>
                    </div>
                </AccordionTab>
                <AccordionTab header="در صورت عدم دریافت پکیج پس از پرداخت، چه باید کرد؟">    
                    <div style={{textAlign:'right'}}>
                        <p>در صورت بروز هرگونه مشکل در دریافت فایل‌های خریداری‌شده، می‌توانید از طریق تماس با پشتیبانی یا ثبت تیکت در حساب کاربری، موضوع را پیگیری نمایید.</p>
                        <p>تیم پشتیبانی بی‌واسط در اسرع وقت مشکل شما را بررسی و برطرف خواهد کرد.</p>
                        <p>لازم به ذکر است از ساعت 14 الی 16 استعلام موجودیت به جهت رفاه حال مالکین انجام نخواهد شد،چنانچه در این ساعات درخواستی داشتید در صف انتظار باقی مانده و پس از ساعات اعلامی به قید فوریت خرید شما ارسال خواهد شد.</p>
                    </div>
                </AccordionTab>
                <AccordionTab header="در صورت عدم اتصال به درگاه پرداخت چه باید کرد؟">    
                    <div style={{textAlign:'right'}}>
                        <p>در صورتی که هنگام پرداخت با مشکل در اتصال به درگاه بانکی مواجه شدید، لطفاً از طریق تماس با پشتیبانی یا ثبت تیکت در حساب کاربری موضوع را اطلاع دهید.</p>
                        <p>تیم پشتیبانی بی‌واسط در کوتاه‌ترین زمان ممکن مشکل را بررسی و راهنمایی‌های لازم را ارائه خواهد داد.</p>
                    </div>
                </AccordionTab>

            </Accordion>
        </div>
    );
}
