'use client';


import {Button} from 'primereact/button';
import Link from 'next/link';
import React from 'react';
import {Panel} from 'primereact/panel';

export default function Faq() {
  return (<div className="card p-fluid">
    <h3 className="text-center">سوالات متداول</h3>
    <hr/>
    <Panel header="در صورت موجود نبودن فایل انتخابی،چه اقداماتی باید انجام داد؟" className="text-lg red m-2">
      <p className="m-2">
        پیش از ارسال شماره تماس، وضعیت فایل‌های انتخابی شما به‌صورت لحظه‌ای استعلام می‌شود.
        در صورتی که فایل اصلی مورد نظر شما قبلاً واگذار شده باشد، فایل‌های رزرو شده شما جایگزین آن شده و برای شما ارسال
        خواهد شد.
      </p>
    </Panel>
    <Panel header="چگونه میتوان فایل های مورد نظر را انتخاب کرد؟" className="text-lg red m-2">
      <p className="m-2">
        پس از استفاده از دسترسی اولیه و مشاهده اطلاعات تماس 3 فایل رایگان، کاربران می‌توانند فایل‌های مورد نظر خود را از
        میان آگهی‌ها انتخاب کنند.
        سپس با انتقال به صفحه درگاه پرداخت و تکمیل فرآیند خرید، شماره تماس مالکان فایل‌های انتخاب‌شده برای کاربر ارسال
        خواهد شد.
      </p>
    </Panel>
    <Panel header="چگونه میتوان آگهی ثبت کرد؟" className="text-lg red m-2">
      <p className="m-2">
        برای ثبت آگهی، ابتدا وارد حساب کاربری خود شوید و از طریق بخش پروفایل، گزینه‌ی ثبت آگهی را انتخاب نمایید.
        سپس با وارد کردن اطلاعات ملک، آگهی شما پس از احراز مالکیت در پلتفرم بی‌واسط منتشر خواهد شد.خواهشمند است چنانچه
        موارد آگهی شده فروش یا اجاره رفته،نسبت به اطلاع رسانی به پلتفرم تحت قالب تیکت اعلام نمایید.
      </p>
    </Panel>
    <Panel header="در صورت عدم دریافت پکیج پس از پرداخت،چه باید کرد؟" className="text-lg red m-2">
      <p className="m-2">
        در صورت بروز هرگونه مشکل در دریافت فایل‌های خریداری‌شده، می‌توانید از طریق تماس با پشتیبانی یا ثبت تیکت در حساب
        کاربری، موضوع را پیگیری نمایید.
        تیم پشتیبانی بی‌واسط در اسرع وقت مشکل شما را بررسی و برطرف خواهد کرد.
        لازم به ذکر است از ساعت 14 الی 16 استعلام موجودیت به جهت رفاه حال مالکین انجام نخواهد شد،چنانچه در این ساعات
        درخواستی داشتید در صف انتظار باقی مانده و پس از ساعات اعلامی به قید فوریت خرید شما ارسال خواهد شد.
      </p>
    </Panel>
    <Panel header="آیا در صورت خرید فایل جهت انعقاد قرارداد نیازی به مراجعه به املاک میباشد؟"
           className="text-lg red m-2">
      <p className="m-2">
        خیر نیاز نیست،مگر مایل به پرداخت کمیسیون باشید.میتوانید بدون پرداخت کمیسیون یا هرگونه مراجعه به سایت های رسمی
        دولتی-خدنویس یا کاتب مراجعه کنید و بدون هزینه نسبت به ثبت قرارداد اقدام کنید(بنا بر قانون مصوب الزام به ثبت
        اسناد غیر منقول در سامانه)یا میتوانید به طور مستقیم به دفاتر اسناد رسمی جهت تنظیم قرارداد اقدام نمایید.لازم به
        ذکر است-قراردادهای اجاره با قدمت زمان 2 سال بایست به دفاتر اسناد رسمی و همچنین معاملات خرید و فروش چنانچه در
        سامانه های ذکر شده ثبت شده باشد می بایست حتما پس از آن به دفاتر اسناد رسمی مراجعه نمایید
      </p>
    </Panel>
    <Panel header="چگونه میتوان اپلیکیشن بی واسط تهیه کرد؟"
           className="text-lg red m-2">
      <p className="m-2">
        کاربران میتوانند جهت نصب اپلیکیشن به صورت دانلود مستقیم یا از فروشگاه گوگل اپ و برای گوشی های ios از وب اپ
        استفاده نمایید.
      </p>
    </Panel>
    <Panel header="خدمات دهی در بی واسط؟"
           className="text-lg red m-2">
      <p className="m-2">
        برای آشنایی و اطمینان بیشتر از خدمات بی‌واسط، هر کاربر پس از ثبت‌نام، امکان دسترسی رایگان به اطلاعات کامل و
        شماره تماس مالکان 3 فایل را دارد.
        پس از آن، برای مشاهده شماره تماس و نشانی سایر فایل‌ها، از گزینه های استعلامی و غیراستعلامی استفاده نمایید.
      </p>
    </Panel>
    <Link href={'/'} className="flex align-content-center justify-content-end mt-3">
      <Button raised type="submit" label="بازگشت" className="bg-gray-300 text-color border-0 w-1"/>
    </Link>
  </div>);
}
