'use client';


import {Button} from 'primereact/button';
import Link from 'next/link';
import React from 'react';
import {Panel} from 'primereact/panel';

export default function Faq() {

  const panelHeaderTemplate = ({className, titleClassName, props}: any) => {
    const classNames = `${className} justify-content-space-between`;
    return <div className={classNames}>
      <h2 className={`${titleClassName}` + ' text-lg m-0'}
          style={{
            color: "inherit!important",
            lineHeight: 1,
            fontWeight: 700,
          }}>{props.header}</h2>
    </div>
  }

  return (<div className="card p-fluid">
    <h1 className="h3 text-center">سوالات متداول بی‌واسط</h1>
    <hr/>
    <Panel headerTemplate={panelHeaderTemplate} header="در صورت موجود نبودن فایل انتخابی،چه اقداماتی باید انجام داد؟"
           className="text-lg red m-2">
      <p className="m-2">
        فایل استعلامی،پیش از ارسال توسط اپراتور، موجود به لحظه استعلام میگردد در صورتی که فایل منتخب شما موجود نبود،از
        موارد جایگزین انتخابی خودتان موجودیت به لحظه استعلام میگردد،سپس ارسال میگردد.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="چگونه میتوان فایل های مورد نظر را انتخاب کرد؟"
           className="text-lg red m-2">
      <p className="m-2">
        {/*پس از استفاده از دسترسی اولیه و مشاهده اطلاعات تماس 10 فایل رایگان، کاربران می‌توانند فایل‌های مورد نظر خود را از*/}
        {/*میان آگهی‌ها انتخاب کنند.*/}
        {/*سپس با انتقال به صفحه درگاه پرداخت و تکمیل فرآیند خرید، شماره تماس مالکان فایل‌های انتخاب‌شده برای کاربر ارسال*/}
        {/*خواهد شد.*/}
        برای کاربران سه گزینه انتخابی وجود دارد:فایل های استعلامی-غیر استعلامی-خرید اشتراک
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="چگونه میتوان آگهی ثبت کرد؟" className="text-lg red m-2">
      <p className="m-2">
        برای ثبت آگهی، ابتدا وارد حساب کاربری خود شوید و از طریق بخش پروفایل، گزینه‌ی ثبت آگهی را انتخاب نمایید.
        سپس با وارد کردن اطلاعات ملک، آگهی شما پس از احراز مالکیت در پلتفرم بی‌واسط منتشر خواهد شد.خواهشمند است چنانچه
        موارد آگهی شده فروش یا اجاره رفته،نسبت به اطلاع رسانی به پلتفرم تحت قالب تیکت اعلام نمایید.
        پس از احراز مالکیت توسط سامانه شاهکار و ثبت من،در پلتفرم بی واسط منتشر خواهد شد.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="در صورت عدم دریافت پکیج پس از پرداخت،چه باید کرد؟"
           className="text-lg red m-2">
      <p className="m-2">
        در صورت بروز هرگونه مشکل در دریافت فایل‌های خریداری‌شده، می‌توانید از طریق تماس با پشتیبانی یا ثبت تیکت در حساب
        کاربری، موضوع را پیگیری نمایید.
        تیم پشتیبانی بی‌واسط در اسرع وقت مشکل شما را بررسی و برطرف خواهد کرد.
        لازم به ذکر است از ساعت 14 الی 16 استعلام موجودیت به جهت رفاه حال مالکین انجام نخواهد شد،چنانچه در این ساعات
        درخواستی داشتید در صف انتظار باقی مانده و پس از ساعات اعلامی به قید فوریت خرید شما ارسال خواهد شد.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate}
           header="آیا در صورت خرید فایل جهت انعقاد قرارداد نیازی به مراجعه به املاک میباشد؟"
           className="text-lg red m-2">
      <p className="m-2">
        خیر نیاز نیست،مگر مایل به پرداخت کمیسیون باشید.میتوانید بدون پرداخت کمیسیون یا هرگونه مراجعه به سایت های رسمی
        دولتی-خدنویس یا کاتب مراجعه کنید و بدون هزینه نسبت به ثبت قرارداد اقدام کنید(بنا بر قانون مصوب الزام به ثبت
        اسناد غیر منقول در سامانه)یا میتوانید به طور مستقیم به دفاتر اسناد رسمی جهت تنظیم قرارداد اقدام نمایید.لازم به
        ذکر است-قراردادهای اجاره با قدمت زمان 2 سال بایست به دفاتر اسناد رسمی و همچنین معاملات خرید و فروش چنانچه در
        سامانه های ذکر شده ثبت شده باشد می بایست حتما پس از آن به دفاتر اسناد رسمی مراجعه نمایید
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="چگونه میتوان اپلیکیشن بی واسط تهیه کرد؟"
           className="text-lg red m-2">
      <p className="m-2">
        کاربران میتوانند جهت نصب اپلیکیشن به صورت دانلود مستقیم یا از فروشگاه گوگل اپ و برای گوشی های ios از وب اپ
        استفاده نمایید.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="خدمات دهی در بی واسط به چه صورت است؟"
           className="text-lg red m-2">
      <p className="m-2">
        امکان دسترسی به 10 عدد فایل رایگان استعلامی را دارد،به همراه شماره تماس مستقیم مالک و نمایش جزئیات فایل پس از
        آن،برای مشاهده موارد منتخبی که صرفا آگهی مالکین می باشد می توانید نسبت به خرید موردی یا تعدادی اقدام نمایید.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="فایل های استعلامی چیست؟"
           className="text-lg red m-2">
      <p className="m-2">
        اینگونه فایل ها در زمان مشخص اعلامی پیش از ارسال به کاربر،توسط اپراتور بی واسط استعلام به لحظه موجودیت شده و پس
        از حصول از موجودیت ارسال میگردد.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="فایل های غیر استعلامی چیست؟"
           className="text-lg red m-2">
      <p className="m-2">
        اینگونه فایل ها با قیمتی پایین تر از فایل های استعلامی بوده و کاربران با انتخاب این گونه فایل ها در هر ساعات از
        شبانه روز می تواند نسبت به خرید اقدام نمایند.
      </p>
    </Panel>
    <Panel headerTemplate={panelHeaderTemplate} header="تفاوت پلتفرم بی واسط با سایر پلتفرم های آگهی گذار چیست؟"
           className="text-lg red m-2">
      <p className="m-2">
        سایر پلتفرم ها صرفا آگهی گذار بوده و در آگهی ها به ندرت آگهی مالکی که ملک خود را شخصی آگهی کرده دیده میشود حتی
        در گزینه آگهی های شخصی پلتفرم ها.هدف ما ارتباط مستقیم مالک با متقاضی ملک هست به همین جهت صرفا آگهی ملک مالکین پس
        از احراز مالکیت توسط پلتفرم به نمایش گذاشته میشود و متقاضیان با اطمینان کامل از اینکه آگهی گذار واسطه نمی باشد
        میتوانند آگهی های منتخب را خریداری نمایند.
      </p>
    </Panel>
    <Link href={'/'} className="flex align-content-center justify-content-end mt-3">
      <Button raised type="submit" label="بازگشت" className="bg-gray-300 text-color border-0 w-1"/>
    </Link>
  </div>);
}
